hfgdwuyi/nxp_mcxn947_pfc/board/pin_mux.c
	/* Define the init structure for the output LED pin*/
	gpio_pin_config_t gpio_config = {
		kGPIO_DigitalOutput,
		0,
	};

	/* Init output LED GPIO. */
	GPIO_PinInit(SS_RLY_EN_GPIO, SS_RLY_EN_GPIO_PIN, &gpio_config);

	/* Init output PFC1_EN GPIO. */
	GPIO_PinInit(PFC1_EN_GPIO, PFC1_EN_GPIO_PIN, &gpio_config);

	/* Init output PFC2_EN GPIO. */
	GPIO_PinInit(PFC2_EN_GPIO, PFC2_EN_GPIO_PIN, &gpio_config);

	/* Init output DCDC1_EN GPIO. */
	GPIO_PinInit(DCDC1_EN_GPIO, DCDC1_EN_GPIO_PIN, &gpio_config);

	/* Init output DCDC2_EN GPIO. */
	GPIO_PinInit(DCDC2_EN_GPIO, DCDC2_EN_GPIO_PIN, &gpio_config);

	/* Init output LED GPIO. */
    GPIO_PinInit(BOARD_LED_GPIO, BOARD_LED_GPIO_PIN, &gpio_config);
	GPIO_PinInit(DBG_LED_GPIO, DBG_LED0_PIN, &gpio_config);
	GPIO_PinInit(DBG_LED_GPIO, DBG_LED1_PIN, &gpio_config);
	GPIO_PinInit(DBG_LED_GPIO, DBG_LED2_PIN, &gpio_config);
	GPIO_PinInit(CAN_LED_GPIO, CAN_LED_RUN_PIN, &gpio_config);
	GPIO_PinInit(CAN_LED_GPIO, CAN_LED_ERROR_PIN, &gpio_config);

	/* Init LCD pin. */
	GPIO_PinInit(BOARD_LCD_CS_GPIO, BOARD_LCD_CS_GPIO_PIN, &gpio_config);
	GPIO_PinInit(BOARD_LCD_RESET_GPIO, BOARD_LCD_RESET_GPIO_PIN, &gpio_config);
	GPIO_PinInit(BOARD_LCD_RS_GPIO, BOARD_LCD_RS_GPIO_PIN, &gpio_config);
	GPIO_PinInit(BOARD_LCD_SDA_GPIO, BOARD_LCD_SDA_GPIO_PIN, &gpio_config);
	GPIO_PinInit(BOARD_LCD_SCL_GPIO, BOARD_LCD_SCL_GPIO_PIN, &gpio_config);
	GPIO_PinInit(BOARD_LCD_ROM_IN_GPIO, BOARD_LCD_ROM_IN_GPIO_PIN, &gpio_config);
	GPIO_PinInit(BOARD_LCD_ROM_OUT_GPIO, BOARD_LCD_ROM_OUT_GPIO_PIN, &gpio_config);
	GPIO_PinInit(BOARD_LCD_ROM_SCK_GPIO, BOARD_LCD_ROM_SCK_GPIO_PIN, &gpio_config);
	GPIO_PinInit(BOARD_LCD_ROM_CS_GPIO, BOARD_LCD_ROM_CS_GPIO_PIN, &gpio_config);

	/* Init output PWM GPIO. */
	GPIO_PinInit(PWM1_GPIO, PWM1_GPIO_PIN, &gpio_config);
	GPIO_PinInit(PWM2_GPIO, PWM2_GPIO_PIN, &gpio_config);
	GPIO_PinInit(PWM3_GPIO, PWM3_GPIO_PIN, &gpio_config);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUART
 * Description   : Configures pin routing for UART
 *
 * END ****************************************************************************************************************/
void BOARD_InitUART(void)
{


	const port_pin_config_t port1_8_pinA1_config = {/* Internal pull-up/down resistor is disabled */
													kPORT_PullDisable,
													/* Low internal pull resistor value is selected. */
													kPORT_LowPullResistor,
													/* Fast slew rate is configured */
													kPORT_FastSlewRate,
													/* Passive input filter is disabled */
													kPORT_PassiveFilterDisable,
													/* Open drain output is disabled */
													kPORT_OpenDrainDisable,
													/* Low drive strength is configured */
													kPORT_LowDriveStrength,
													/* Pin is configured as FC4_P0 */
													kPORT_MuxAlt2,
													/* Digital input enabled */
													kPORT_InputBufferEnable,
													/* Digital input is not inverted */
													kPORT_InputNormal,
													/* Pin Control Register fields [15:0] are not locked */
													kPORT_UnlockRegister};
	/* PORT1_8 (pin A1) is configured as FC4_P0 */
	PORT_SetPinConfig(PORT1, 8U, &port1_8_pinA1_config);

	const port_pin_config_t port1_9_pinB1_config = {/* Internal pull-up/down resistor is disabled */
													kPORT_PullDisable,
													/* Low internal pull resistor value is selected. */
													kPORT_LowPullResistor,
													/* Fast slew rate is configured */
													kPORT_FastSlewRate,
													/* Passive input filter is disabled */
													kPORT_PassiveFilterDisable,
													/* Open drain output is disabled */
													kPORT_OpenDrainDisable,
													/* Low drive strength is configured */
													kPORT_LowDriveStrength,
													/* Pin is configured as FC4_P1 */
													kPORT_MuxAlt2,
													/* Digital input enabled */
													kPORT_InputBufferEnable,
													/* Digital input is not inverted */
													kPORT_InputNormal,
													/* Pin Control Register fields [15:0] are not locked */
													kPORT_UnlockRegister};
	/* PORT1_9 (pin B1) is configured as FC4_P1 */
	PORT_SetPinConfig(PORT1, 9U, &port1_9_pinB1_config);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPI
 * Description   : Configures pin routing for SPI
 *
 * END ****************************************************************************************************************/
// void BOARD_InitSPI(void)
// {

// }

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitIIC
 * Description   : Configures pin routing for IIC
 *
 * END ****************************************************************************************************************/
// void BOARD_InitIIC(void)
// {

// }

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCAN
 * Description   : Configures pin routing for CAN
 *
 * END ****************************************************************************************************************/
void BOARD_InitCAN(void)
{
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port1);
	const port_pin_config_t port1_10_pinC3_config = {/* Internal pull-up/down resistor is disabled */
														 kPORT_PullDisable,
														 /* Low internal pull resistor value is selected. */
														 kPORT_LowPullResistor,
														 /* Fast slew rate is configured */
														 kPORT_FastSlewRate,
														 /* Passive input filter is disabled */
														 kPORT_PassiveFilterDisable,
														 /* Open drain output is disabled */
														 kPORT_OpenDrainDisable,
														 /* Low drive strength is configured */
														 kPORT_LowDriveStrength,
														 /* Pin is configured as CAN0_TXD */
														 kPORT_MuxAlt11,
														 /* Digital input enabled */
														 kPORT_InputBufferEnable,
														 /* Digital input is not inverted */
														 kPORT_InputNormal,
														 /* Pin Control Register fields [15:0] are not locked */
														 kPORT_UnlockRegister};
		/* PORT1_10 (pin C3) is configured as CAN0_TXD */
		PORT_SetPinConfig(PORT1, 10U, &port1_10_pinC3_config);

		const port_pin_config_t port1_11_pinD3_config = {/* Internal pull-up/down resistor is disabled */
														 kPORT_PullDisable,
														 /* Low internal pull resistor value is selected. */
														 kPORT_LowPullResistor,
														 /* Fast slew rate is configured */
														 kPORT_FastSlewRate,
														 /* Passive input filter is disabled */
														 kPORT_PassiveFilterDisable,
														 /* Open drain output is disabled */
														 kPORT_OpenDrainDisable,
														 /* Low drive strength is configured */
														 kPORT_LowDriveStrength,
														 /* Pin is configured as CAN0_RXD */
														 kPORT_MuxAlt11,
														 /* Digital input enabled */
														 kPORT_InputBufferEnable,
														 /* Digital input is not inverted */
														 kPORT_InputNormal,
														 /* Pin Control Register fields [15:0] are not locked */
														 kPORT_UnlockRegister};
		/* PORT1_11 (pin D3) is configured as CAN0_RXD */
		PORT_SetPinConfig(PORT1, 11U, &port1_11_pinD3_config);
}

