hfgdwuyi/nxp_mcxn947_pfc/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUART
 * Description   : Configures pin routing for UART
 *
 * END ****************************************************************************************************************/
void BOARD_InitADC(void){
	/* Enables the clock for PORT4: Enables clock */
	CLOCK_EnableClock(kCLOCK_Port4);

	const port_pin_config_t port_ADC_config = {/* Internal pull-up/down resistor is disabled */
												  kPORT_PullDisable,
												  /* Low internal pull resistor value is selected. */
												  kPORT_LowPullResistor,
												  /* Fast slew rate is configured */
												  kPORT_FastSlewRate,
												  /* Passive input filter is disabled */
												  kPORT_PassiveFilterDisable,
												  /* Open drain output is disabled */
												  kPORT_OpenDrainDisable,
												  /* Low drive strength is configured */
												  kPORT_LowDriveStrength,
												  /* Pin is configured as ADC0_A2 */
												  kPORT_MuxAlt0,
												  /* Digital input disabled; it is required for analog functions */
												  kPORT_InputBufferDisable,
												  /* Digital input is not inverted */
												  kPORT_InputNormal,
												  /* Pin Control Register fields [15:0] are not locked */
												  kPORT_UnlockRegister};
	/* PORT4_16 (pin R8) is configured as ADC0_A6 */
	PORT_SetPinConfig(PORT4, 16U, &port_ADC_config);

	/* PORT4_17 (pin R9) is configured as ADC0_B6 */
	PORT_SetPinConfig(PORT4, 17U, &port_ADC_config);

	/* PORT4_19 (pin R10) is configured as ADC0_B1 */
	PORT_SetPinConfig(PORT4, 19U, &port_ADC_config);

	/* PORT4_13 (pin T7) is configured as ADC0_B5 */
	PORT_SetPinConfig(PORT4, 13U, &port_ADC_config);

	/* PORT4_20 (pin T10) is configured as ADC1_A6 */
	PORT_SetPinConfig(PORT4, 20U, &port_ADC_config);

	/* PORT4_13 (pin T7) is configured as ADC1_B5 */
	PORT_SetPinConfig(PORT4, 13U, &port_ADC_config);

	/* PORT5_0 (pin U16) is configured as ADC1_B8 */
	PORT_SetPinConfig(PORT5, 0U, &port_ADC_config);

	/* PORT5_1 (pin U17) is configured as ADC1_B9 */
	PORT_SetPinConfig(PORT5, 1U, &port_ADC_config);

	/* PORT5_2 (pin M10) is configured as ADC1_B10 */
	PORT_SetPinConfig(PORT5, 2U, &port_ADC_config);

	/* PORT5_3 (pin M11) is configured as ADC1_B11 */
	PORT_SetPinConfig(PORT5, 3U, &port_ADC_config);

}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUART
 * Description   : Configures pin routing for UART
 *
 * END ****************************************************************************************************************/
void BOARD_InitDAC(void){
    const port_pin_config_t port_DAC_config = {/* Internal pull-up/down resistor is disabled */
                                                    kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    kPORT_LowDriveStrength,
                                                    /* Pin is configured as DAC0_OUT */
                                                    kPORT_MuxAlt0,
                                                    /* Digital input disabled; it is required for analog functions */
                                                    kPORT_InputBufferDisable,
                                                    /* Digital input is not inverted */
                                                    kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    kPORT_UnlockRegister};
    /* PORT4_2 (pin T1) is configured as DAC0_OUT */
    PORT_SetPinConfig(PORT4, 2U, &port_DAC_config);
    /* PORT4_3 (pin U1) is configured as DAC1_OUT */
    PORT_SetPinConfig(PORT4, 3U, &port_DAC_config);
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWM
 * Description   : Configures pin routing for PWM
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWM(void){
    /* Enables the clock for PORT1: Enables clock */
    CLOCK_EnableClock(kCLOCK_Port2);

    const port_pin_config_t port_PWM_config = {/* Internal pull-up/down resistor is disabled */
                                                      kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      kPORT_LowDriveStrength,
                                                      /* Pin is configured as CT0_MAT0 */
                                                      kPORT_MuxAlt4,
                                                      /* Digital input enabled */
                                                      kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      kPORT_UnlockRegister};
    /* PORT2_0 (pin H2) is configured as CT0_MAT0 */
    PORT_SetPinConfig(PORT2, 0U, &port_PWM_config);
    /* PORT2_1 (pin H1) is configured as CT0_MAT0 */
    PORT_SetPinConfig(PORT2, 1U, &port_PWM_config);
    /* PORT2_7 (pin L2) is configured as FLEXIO0_D15 */
    PORT_SetPinConfig(PORT2, 7U, &port_PWM_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
